In [16]:
import pandas as pd
example = pd.DataFrame({'Month':['January','January','January','January',
                                'February','February','February','February',
                                'March','March','March','March',],
                        'Category':['Transporation','Grocery','Household','Entertainment',
                                    'Transporation','Grocery','Household','Entertainment',
                                    'Transporation','Grocery','Household','Entertainment',],
                        'Amount':[74.,236.,175.,100.,115.,240.,225.,125.,90.,260.,200.,120.]})
example

       Month       Category  Amount
0    January  Transporation    74.0
1    January        Grocery   236.0
2    January      Household   175.0
3    January  Entertainment   100.0
4   February  Transporation   115.0
5   February        Grocery   240.0
6   February      Household   225.0
7   February  Entertainment   125.0
8      March  Transporation    90.0
9      March        Grocery   260.0
10     March      Household   200.0
11     March  Entertainment   120.0

In [5]:
example_pivot = example.pivot(index='Category',columns='Month',values='Amount')
example_pivot

Month          February  January  March
Category
Entertainment     125.0    100.0  120.0
Grocery           240.0    236.0  260.0
Household         225.0    175.0  200.0
Transporation     115.0     74.0   90.0

In [6]:
example_pivot.sum(axis=1)

Category
Entertainment    345.0
Grocery          736.0
Household        600.0
Transporation    279.0
dtype: float64

In [7]:
example_pivot.sum(axis=0)

Month
February    705.0
January     585.0
March       670.0
dtype: float64

In [19]:
# example_pivot1 = example.pivot_table(index='Category',columns='Month',values='Amount',aggfunc='max') # aggfunc 默認求平均  account計數 mean 均值
example_pivot1 = pd.crosstab(index=example['Category'],columns=example['Month']) #計數
example_pivot1

Month          February  January  March
Category
Entertainment         1        1      1
Grocery               1        1      1
Household             1        1      1
Transporation         1        1      1

In [29]:
example['less'] = example['Amount'] <= 200
example.pivot(index='Category',columns='Month',values='less')

Month          February  January  March
Category
Entertainment      True     True   True
Grocery           False    False  False
Household         False     True   True
Transporation      True     True   True